CORRIDAS/PR0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forces"
}

functions
{
    probes
    {
        // Where to load it from
        libs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    writeTime;
        writeInterval  1;

        // Fields to be probed
        fields
        (
            p U
        );

        probeLocations
        (
            //perfil
            (0.160000 0.000000 0)
			(0.159829 0.000062 0)
			(0.159315 0.000250 0)
			(0.158462 0.000558 0)
			(0.157274 0.000976 0)
			(0.155755 0.001491 0)
			(0.153910 0.002085 0)
			(0.151750 0.002746 0)
			(0.149282 0.003466 0)
			(0.146517 0.004243 0)
			(0.143469 0.005074 0)
			(0.140147 0.005947 0)
			(0.136568 0.006853 0)
			(0.132747 0.007781 0)
			(0.128701 0.008725 0)
			(0.124446 0.009677 0)
			(0.120000 0.010627 0)
			(0.115382 0.011563 0)
			(0.110614 0.012472 0)
			(0.105715 0.013346 0)
			(0.100706 0.014173 0)
			(0.095608 0.014946 0)
			(0.090442 0.015656 0)
			(0.085232 0.016296 0)
			(0.080000 0.016861 0)
			(0.074768 0.017339 0)
			(0.069558 0.017722 0)
			(0.064392 0.017997 0)
			(0.059294 0.018152 0)
			(0.054285 0.018178 0)
			(0.049386 0.018070 0)
			(0.044618 0.017826 0)
			(0.040000 0.017445 0)
			(0.035554 0.016934 0)
			(0.031299 0.016304 0)
			(0.027253 0.015562 0)
			(0.023432 0.014712 0)
			(0.019853 0.013771 0)
			(0.016531 0.012752 0)
			(0.013483 0.011653 0)
			(0.010718 0.010466 0)
			(0.008250 0.009205 0)
			(0.006090 0.007899 0)
			(0.004245 0.006589 0)
			(0.002726 0.005285 0)
			(0.001538 0.003982 0)
			(0.000685 0.002646 0)
			(0.000171 0.001320 0)
			(0.000000 0.000120 0)
			(0.000171 -0.000906 0)
			(0.000685 -0.001763 0)
			(0.001538 -0.002544 0)
			(0.002726 -0.003298 0)
			(0.004245 -0.004003 0)
			(0.006090 -0.004664 0)
			(0.008250 -0.005250 0)
			(0.010718 -0.005731 0)
			(0.013483 -0.006107 0)
			(0.016531 -0.006386 0)
			(0.019853 -0.006570 0)
			(0.023432 -0.006666 0)
			(0.027253 -0.006683 0)
			(0.031299 -0.006635 0)
			(0.035554 -0.006525 0)
			(0.040000 -0.006358 0)
			(0.044618 -0.006152 0)
			(0.049386 -0.005920 0)
			(0.054285 -0.005675 0)
			(0.059294 -0.005424 0)
			(0.064392 -0.005166 0)
			(0.069558 -0.004901 0)
			(0.074768 -0.004626 0)
			(0.080000 -0.004341 0)
			(0.085232 -0.004046 0)
			(0.090442 -0.003744 0)
			(0.095608 -0.003438 0)
			(0.100706 -0.003133 0)
			(0.105715 -0.002835 0)
			(0.110614 -0.002554 0)
			(0.115382 -0.002288 0)
			(0.120000 -0.002043 0)
			(0.124446 -0.001818 0)
			(0.128701 -0.001610 0)
			(0.132747 -0.001418 0)
			(0.136568 -0.001240 0)
			(0.140147 -0.001078 0)
			(0.143469 -0.000933 0)
			(0.146517 -0.000803 0)
			(0.149282 -0.000690 0)
			(0.151750 -0.000582 0)
			(0.153910 -0.000475 0)
			(0.155755 -0.000363 0)
			(0.157274 -0.000250 0)
			(0.158462 -0.000147 0)
			(0.159315 -0.000067 0)
			(0.159829 -0.000018 0)
			(0.160000 0.000000 0)
        );
    }
}


// ************************************************************************* //
